In [1]:
import sqlite3
import pandas as pd
from pathlib import Path

DB_PATH = Path("data/finance.db")  # adjust if needed

conn = sqlite3.connect(DB_PATH)

# List tables
tables = pd.read_sql(
    "SELECT name FROM sqlite_master WHERE type='table'",
    conn
)
print("Tables:")
print(tables)

# View settings
print("\n--- SETTINGS ---")
print(pd.read_sql("SELECT * FROM settings", conn))

# View month lines
print("\n--- MONTH_LINES ---")
print(pd.read_sql("SELECT * FROM month_lines ORDER BY month, line_type, category", conn))

# View FX rates
print("\n--- FX_RATES ---")
print(pd.read_sql("SELECT * FROM fx_rates ORDER BY month", conn))

conn.close()

Tables:
            name
0  monthly_lines
1       settings
2     monthly_fx

--- SETTINGS ---
                    key                                              value
0      starting_savings                                                  0
1    expense_categories  Food,Rent,Subscriptions,Self-care,Cleaning,Pho...
2     income_categories  Leftovers,Tatiana_salary_barcelona,Ben__salary...
3  app_passcode_enabled                                                  0
4          app_passcode

--- MONTH_LINES ---

DatabaseError: Execution failed on sql 'SELECT * FROM month_lines ORDER BY month, line_type, category': no such table: month_lines

In [3]:
import sqlite3
import pandas as pd
from pathlib import Path

DB_PATH = Path("data/finance.db")  # <-- keep what you used

print("DB exists:", DB_PATH.exists())
print("DB absolute path:", DB_PATH.resolve())
print("DB size (bytes):", DB_PATH.stat().st_size if DB_PATH.exists() else None)

conn = sqlite3.connect(DB_PATH)

tables = pd.read_sql("""
SELECT name, type
FROM sqlite_master
WHERE type IN ('table','view')
ORDER BY type, name
""", conn)

print("\nObjects in DB (tables/views):")
print(tables)

conn.close()

DB exists: True
DB absolute path: C:\Users\Asus\Desktop\family_finance_dashboard\data\finance.db
DB size (bytes): 45056

Objects in DB (tables/views):
            name   type
0     monthly_fx  table
1  monthly_lines  table
2       settings  table

In [4]:
tables

            name   type
0     monthly_fx  table
1  monthly_lines  table
2       settings  table

In [5]:
import sqlite3
import pandas as pd
from pathlib import Path

DB_PATH = Path("data/finance.db")  # keep the same path you used

conn = sqlite3.connect(DB_PATH)

df = pd.read_sql(
    """
    SELECT *
    FROM monthly_lines
    ORDER BY month, line_type, category
    """,
    conn
)

conn.close()

df

       month line_type                  category    amount
0    2025-01   expense          Balashiha Credit       0.0
1    2025-01   expense     Balashiha Electricity   16425.0
2    2025-01   expense         Balashiha Storage       0.0
3    2025-01   expense            Barcelona_bill       0.0
4    2025-01   expense           Borrowed moscow       0.0
..       ...       ...                       ...       ...
187  2025-12    income  Tatiana_salary_barcelona    2800.0
188  2025-12    income     Tatiana_salary_moscow  180000.0
189  2025-12    income              other_income     500.0
190  2025-12    income          salary_barcelona    3000.0
191  2025-12    income             salary_moscow    2000.0

[192 rows x 4 columns]

In [8]:
df[(df['month'] == '2025-01') & (df['line_type'] == 'income')]

      month line_type                  category  amount
61  2025-01    income     Ben__salary_barcelona     0.0
62  2025-01    income         Ben_salary_moscow     0.0
63  2025-01    income                Correction     0.0
64  2025-01    income                 Leftovers     0.0
65  2025-01    income              Other_income     0.0
66  2025-01    income       Other_income_moscow     0.0
67  2025-01    income               Rent_moscow     0.0
68  2025-01    income          Salary_barcelona  2560.0
69  2025-01    income  Tatiana_salary_barcelona     0.0
70  2025-01    income     Tatiana_salary_moscow     0.0

Reset database

In [9]:
import sqlite3
from pathlib import Path

DB_PATH = Path("data/finance.db")
conn = sqlite3.connect(DB_PATH)
cur = conn.cursor()

cur.execute("DELETE FROM monthly_lines;")
cur.execute("DELETE FROM monthly_fx;")  # your fx table name is monthly_fx
conn.commit()
conn.close()

print("All monthly data deleted (lines + fx).")

All monthly data deleted (lines + fx).